{"class_name": "Functional", "config": {"name": "model_2", "trainable": true, "layers": [{"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "user_input"}, "registered_name": null, "name": "user_input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "InputLayer", "config": {"batch_input_shape": [null, 1], "dtype": "float32", "sparse": false, "ragged": false, "name": "item_input"}, "registered_name": null, "name": "item_input", "inbound_nodes": []}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "user_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 1], "input_dim": 611, "output_dim": 100, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "user_embedding", "inbound_nodes": [[["user_input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Embedding", "config": {"name": "item_embedding", "trainable": true, "dtype": "float32", "batch_input_shape": [null, 1], "input_dim": 193610, "output_dim": 100, "embeddings_initializer": {"module": "keras.initializers", "class_name": "RandomUniform", "config": {"minval": -0.05, "maxval": 0.05, "seed": null}, "registered_name": null}, "embeddings_regularizer": null, "activity_regularizer": null, "embeddings_constraint": null, "mask_zero": false, "input_length": 1}, "registered_name": null, "build_config": {"input_shape": [null, 1]}, "name": "item_embedding", "inbound_nodes": [[["item_input", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_users", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 1, 100]}, "name": "flatten_users", "inbound_nodes": [[["user_embedding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Flatten", "config": {"name": "flatten_items", "trainable": true, "dtype": "float32", "data_format": "channels_last"}, "registered_name": null, "build_config": {"input_shape": [null, 1, 100]}, "name": "flatten_items", "inbound_nodes": [[["item_embedding", 0, 0, {}]]]}, {"module": "keras.layers", "class_name": "Dot", "config": {"name": "dot_product", "trainable": true, "dtype": "float32", "axes": 1, "normalize": false}, "registered_name": null, "build_config": {"input_shape": [[null, 100], [null, 100]]}, "name": "dot_product", "inbound_nodes": [[["flatten_users", 0, 0, {}], ["flatten_items", 0, 0, {}]]]}], "input_layers": [["user_input", 0, 0], ["item_input", 0, 0]], "output_layers": [["dot_product", 0, 0]]}, "keras_version": "2.15.0", "backend": "tensorflow"}